#include "GameScene.h"
#include"../SceneManager.h"
#include"../../Object/BackGround/BackGround.h"
#include"../../Object/Ground/Ground.h"
#include"../../Object/Player/Player.h"
#include"../../Object/Enemy/Enemy.h"
void GameScene::Event()
{
	//カメラ======================================================================================================
	
	//プレイヤーの座標を取得する==========================================================================
	Math::Vector3 playerPos = {};

	//weak_ptrで保持しているm_playerが有効かどうかを調べる
	//expired() ・・・ 既に無効ならtrueを返す
	if (m_player.expired() == false)
	{
		playerPos = m_player.lock()->GetPos();

		//std::shared_ptr<Player> _work = m_player.lock();
		//playerPos = _work->GetPos();
	}
	//====================================================================================================

	//行列更新============================================================================================
	Math::Matrix RotX = Math::Matrix::CreateRotationX(DirectX::XMConvertToRadians(30));  //カメラの角度
	Math::Matrix Trans = Math::Matrix::CreateTranslation(playerPos.x, playerPos.y + 3, playerPos.z - 3); //カメラの位置
	Math::Matrix Mat = RotX * Trans;                                                     //行列合成
	m_camera->SetCameraMatrix(Mat);                                                      //行列セット
	//====================================================================================================

	//============================================================================================================
}

void GameScene::Init()
{
	//カメラ　生成＆視野角設定====================================================================================
	m_camera = std::make_unique<KdCamera>();  //メモリ確保
	m_camera->SetProjectionMatrix(60);        //視野角設定
	//============================================================================================================
	
	//背景========================================================================================================
	std::shared_ptr<BackGround> back = std::make_shared<BackGround>();  //メモリ確保
	back->Init();                                                       //初期化
	m_objList.push_back(back);                                          //リストへ追加
	//============================================================================================================

	//地面========================================================================================================
	std::shared_ptr<Ground> ground = std::make_shared<Ground>();  //メモリ確保
	ground->Init();												  //初期化
	m_objList.push_back(ground);								  //リストへ追加
	//============================================================================================================

	//プレイヤー==================================================================================================
	std::shared_ptr<Player> player = std::make_shared<Player>();  //メモリ確保
	player->Init();												  //初期化
	m_objList.push_back(player);								  //リストへ追加

	m_player = player;                                            //プレイヤーの情報を保持しておく
	//============================================================================================================

	//敵==========================================================================================================
	for (int i = 0; i < 20; ++i)
	{
		std::shared_ptr<Enemy>enemy = std::make_shared<Enemy>();
		enemy->SetPos(Math::Vector3{ -50.0f + (10.0f * i),0.0f,10.0f });
		enemy->SetTarget(m_player);
		m_objList.push_back(enemy);
	}
	//============================================================================================================
}
